import math

# Труба
d_1=int(input ("Диаметр основания:"))
d_2=int(input("Внутренный диаметр:"))
h_1=int(input("Высота цилиндра:"))
V_1=(math.pi) * ((d_1/2)**2-(d_2/2)**2)*h_1/1000000 
print ("Объём в литрах:", V_1)

# Конус
d_3=int(input("Диаметр основания: "))
d_4=int(input("Диаметр верхней площадки: "))
h_2=int(input("Высота:"))
V_2=(math.pi) * ((d_3/2)**2 + (d_3*d_4/2) + (d_4/2)**2)*h_2/3000000 
print ("Объём в литрах :", V_2)

# Куб
a=int(input("Длина: "))
b=int(input("Ширина: "))
c=int(input("Высота: "))
V_3= a*b*c/1000000
print ("Объём: ", V_3)